Assign a name to a switch.
Switch# configure terminal
Switch(config)# hostname S1
S1(config)# exit
S1#

Secure access to the console line.
S1# configure terminal
Enter configuration commands, one per line. End with CNTL/Z.
S1(config)# line console 0
S1(config-line)# password (type you password here)
S1(config-line)# login
S1(config-line)# exit
S1(config)# exit
%SYS-5-CONFIG_I: Configured from console by console
S1#

Secure privileged mode access.
S1> enable
S1# configure terminal
S1(config)# enable password (type you second password here)
S1(config)# exit
%SYS-5-CONFIG_I: Configured from console by console
S1#

Configure an encrypted password to secure access to privileged mode.
S1# config t
S1(config)# enable secret itsasecret
S1(config)# exit
S1#

Encrypt the enable and console passwords.
S1# config t
S1(config)# service password-encryption
S1(config)# exit

Configure a message of the day (MOTD) banner
S1# config t
S1(config)# banner motd (type your messege here, don't forget the "")
S1(config)# exit
%SYS-5-CONFIG_I: Configured from console by console
S1# 

Save the configuration file.
S1# copy running-config startup-config
Destination filename [startup-config]?[Enter]
Building configuration...
[OK]

Configure both PCs with IP addresses.
Click PC1 and then click the Desktop tab.
Click IP Configuration. In the Addressing Table above, you can see that the IP address for PC1 is192.168.1.1 and the subnet mask is 255.255.255.0. 
Enter this information for PC1 in the IPConfiguration window.

Configure S1 with an IP address.
S1# configure terminal
Enter configuration commands, one per line. End with CNTL/Z.
S1(config)# interface vlan 1
S1(config-if)# ip address 192.168.1.253 255.255.255.0
S1(config-if)# no shutdown
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
S1(config-if)#
S1(config-if)# exit
S1#

Save configurations for S1 and S2 to NVRAM.
S1# copy running-config startup-config

